{
  "recommendations": [
    {
      "uid": "arch_2p9k1f",
      "name": "Family Weeknight Omnivore Classics (Halal-friendly)",
      "action": "modify",
      "notes": "Overlaps with arch_3e2c1a on mainstream omnivore family weeknights. Keep but clarify Halal posture and standardize tags. Remove nonstandard core_tags.Allergens and add clear allergen stance in description.",
      "suggested_changes": {
        "core_tags": {
          "Allergens": [],
          "BudgetLevel": [
            "Affordable"
          ],
          "CuisineOpenness": [
            "FamiliarClassics"
          ]
        },
        "description": "Broad-appeal halal-friendly dinners for South African families: mild, 15–30 minute, simple stovetop or sheet-pan meals with affordable spend and familiar SA/Modern American comfort profiles. Not allergen-safe; contains common allergens unless user filters. Avoids pork and alcohol per halal norms."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_7e3a9b",
      "name": "Family Veggie Weeknight Classics",
      "action": "modify",
      "notes": "One of three very similar family vegetarian weeknight baselines. Convert this variant to DairyFree-focused to satisfy the brief’s dedicated dairy-free archetype requirement and reduce overlap.",
      "suggested_changes": {
        "core_tags": {
          "Allergens": [],
          "Diet": [
            "Vegetarian"
          ],
          "BudgetLevel": [
            "Balanced"
          ],
          "CuisineOpenness": [
            "FamiliarClassics"
          ]
        },
        "description": "Balanced, kid-friendly vegetarian dinners for South African and Modern American palates; dairy-free by default to serve the dairy-free cohort. Mild flavors, 15–30 minutes, simple steps, and a Balanced spend. Eggs optional; plant-based substitutes provided where helpful."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_3b4f9k",
      "name": "Solo Quick Bites Flex",
      "action": "modify",
      "notes": "Overlaps with arch_8f2k9x and arch_3a1b9k (solo under-15, familiar, value). Keep but differentiate via NoHeat for sensitive solo diners and reinforce nut/shellfish avoidance as a nut-free solo baseline.",
      "suggested_changes": {
        "core_tags": {
          "HeatSpice": [
            "NoHeat"
          ],
          "Allergens": []
        },
        "description": "Ultra-fast, one-pan or air-fryer-friendly meals for solo diners who are flexitarian. No-heat seasoning for sensitive palates, Under-15-minute prep, Simple steps, ValueStaples budget. Defaults are nut-free and shellfish-free; swap-ins optional."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_6k2w9e",
      "name": "Mediterranean Pescatarian Date-Night",
      "action": "keep",
      "notes": "Distinct couple-focused pescatarian with shellfish-free guardrail and Intermediate complexity; meets cuisine, audience, budget, and allergen requirements.",
      "suggested_changes": {},
      "replacement_proposal": null
    },
    {
      "uid": "arch_k7x3q9",
      "name": "Gluten-Aware Sheet-Pan Meal Prep Basics",
      "action": "keep",
      "notes": "Provides GlutenAware MealPrep with 45Plus hands-off and NoHeat; satisfies allergen-safe gluten-free cohort.",
      "suggested_changes": {},
      "replacement_proposal": null
    },
    {
      "uid": "arch_2s9h3k",
      "name": "Family Poultry-Only SA Twists",
      "action": "modify",
      "notes": "Overlaps with arch_3q1h2k (both poultry-only family mild weeknights). Differentiate by shifting to Intermediate complexity and adding simple glazing/roasting techniques.",
      "suggested_changes": {
        "core_tags": {
          "Complexity": [
            "Intermediate"
          ],
          "Allergens": []
        },
        "description": "Family-friendly poultry dinners with South African staples and gentle regional twists; mild spice, 15–30 minutes, Intermediate techniques (quick marinades, pan sauces), Balanced budget; avoids fish/shellfish and suits kosher-style households avoiding red meat or pork."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_7f3a9d",
      "name": "Vegan High-Protein Meal Prep Bowls (Global Explorer)",
      "action": "modify",
      "notes": "Good coverage, but clarify gluten posture and soy default to align with allergen guardrails; remove core_tags.Allergens.",
      "suggested_changes": {
        "core_tags": {
          "Allergens": []
        },
        "description": "Batch-cook vegan bowls for MealPrep households using affordable pantry staples with Mediterranean/Middle Eastern flavors; Medium heat, Simple steps, 30–45 minutes. Defaults avoid dairy, egg, fish, shellfish, peanuts, and tree nuts; sesame/mustard may appear. Soy is optional opt-in; gluten kept minimal with GF swaps noted."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_5u6h1q",
      "name": "Jain-Friendly Weeknight Vegan Classics",
      "action": "modify",
      "notes": "Overlaps with arch_1k7p9f (both Jain-friendly vegan family, 15–30, NoHeat). Differentiate this one by setting Indian-only cuisine and ValueStaples budget, while keeping the other as Indo-SA mix and HighProtein.",
      "suggested_changes": {
        "core_tags": {
          "Cuisine": [
            "Indian"
          ],
          "BudgetLevel": [
            "ValueStaples"
          ],
          "Allergens": []
        },
        "description": "Fast, no-heat Indian familiar classics tailored for Jain-friendly vegan family dinners on a ValueStaples budget; avoids root vegetables and animal products while keeping flavors gentle for kids."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_5k3z9h",
      "name": "Shellfish-Free Pescatarian Entertaining Showstopper",
      "action": "modify",
      "notes": "Solid entertaining Showstopper but we need LuxuryExperience representation and at least one Hot/ExtraHot band. Shift budget to LuxuryExperience and heat to Hot to provide an opt-in premium spicy lane.",
      "suggested_changes": {
        "core_tags": {
          "BudgetLevel": [
            "LuxuryExperience"
          ],
          "HeatSpice": [
            "Hot"
          ]
        },
        "description": "A luxury, guest-ready pescatarian spread with EastAsian GlobalExplorer vibes that stays shellfish-free, gluten-free, and nut-free by design; Hot heat band, 45+ minute hands-off-and-finish cooking with Showstopper presentation for Entertaining."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_3f4k9z",
      "name": "Family Low-Carb Weeknight Basics",
      "action": "modify",
      "notes": "Strong baseline but we need more Intermediate/Advanced coverage. Elevate to Intermediate with quick sauté-plus-sauce sequences without raising time/budget.",
      "suggested_changes": {
        "core_tags": {
          "Complexity": [
            "Intermediate"
          ]
        },
        "description": "Everyday low-carb family dinners with quick skillet and sheet-pan staples; 15–30 minutes, Intermediate techniques (deglazing, pan sauces), Mild heat, Affordable budget; ModernAmerican and Mediterranean familiar flavors."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_7f1c9k",
      "name": "Kosher-Style Flex Meal Prep (Mediterranean & Middle Eastern)",
      "action": "keep",
      "notes": "Covers Kosher-style ethics + MealPrep at Intermediate and Balanced; distinct and aligned.",
      "suggested_changes": {},
      "replacement_proposal": null
    },
    {
      "uid": "arch_3e2c1a",
      "name": "Family Omnivore Weeknight Classics",
      "action": "modify",
      "notes": "Overlaps with arch_2p9k1f; keep as the non-ethics baseline but standardize tags and remove core_tags.Allergens.",
      "suggested_changes": {
        "core_tags": {
          "Allergens": []
        },
        "description": "Balanced, kid-friendly omnivore dinners for SA/Modern American weeknights: quick two-pan mains with veg sides, affordable staples, mild seasoning, and clear swap notes for common allergens—ideal for families needing 15–30 minute, Simple meals."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_7k0x9u",
      "name": "Vegetarian Family Weeknight Classics",
      "action": "replace",
      "notes": "Substantial overlap with arch_7e3a9b and arch_3k9x8h. Use this slot to add a missing cuisine/openness/heat/budget: LatinAmerican, Hot, RegionalTwist/GlobalExplorer, and Affordable/Balanced family profile.",
      "suggested_changes": {},
      "replacement_proposal": {
        "name": "Family Latin American Fiesta Nights (Hot, RegionalTwist, Balanced)",
        "concept_summary": "Diet: Omnivore; Cuisine: LatinAmerican; CuisineOpenness: RegionalTwist; PrepTime: 30to45; Complexity: Intermediate; HeatSpice: Hot (opt-in); Audience: Family; BudgetLevel: Balanced; EthicsReligious: []; Allergen posture: not allergen-safe, with clear swaps for gluten/dairy. Purpose: Fill LatinAmerican + Hot + Intermediate + family gap."
      }
    },
    {
      "uid": "arch_8f2k9x",
      "name": "Solo Value Staples Quick Bites (Air-Fry & Stovetop)",
      "action": "modify",
      "notes": "Overlaps with arch_3b4f9k and arch_3a1b9k. Differentiate by setting Heat to Mild and explicitly focusing on AirFry format to align with Occasion/Format anchors.",
      "suggested_changes": {
        "core_tags": {
          "CuisineOpenness": [
            "FamiliarClassics"
          ]
        },
        "description": "Ultra-fast single-serve meals using pantry staples and freezer-friendly basics for solo eaters; Omnivore/Flex-friendly, Mild heat, Under-15, Simple, ValueStaples budget, with an explicit AirFry-first approach and stovetop alternates."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_k5q0zt",
      "name": "Couple Omnivore Weeknight Classics (SA & Modern American)",
      "action": "modify",
      "notes": "Good couple baseline; formalize as dedicated NutFree archetype to meet allergen-safe nut-free cohort requirement.",
      "suggested_changes": {
        "core_tags": {
          "Allergens": []
        },
        "description": "Fast, comforting omnivore dinners for two with SA/Modern American flavors; Mild heat, 15–30 minutes, Simple, Balanced budget. Dedicated nut-free posture by default (avoids peanuts and tree nuts); shellfish optional and clearly flagged."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_3f6a9d",
      "name": "Family Gluten-Aware Weeknight Basics",
      "action": "keep",
      "notes": "Meets mainstream gluten-aware family baseline with Halal alignment; complements MealPrep gluten-aware.",
      "suggested_changes": {},
      "replacement_proposal": null
    },
    {
      "uid": "arch_3q1h2k",
      "name": "Halal-Friendly Poultry Weeknight Classics (Family)",
      "action": "modify",
      "notes": "Overlaps with arch_2s9h3k. Differentiate by setting CuisineOpenness to RegionalTwist (already set) and shifting PrepTime to 30–45 to broaden prep-time distribution.",
      "suggested_changes": {
        "core_tags": {
          "PrepTime": [
            "30to45"
          ],
          "Allergens": []
        },
        "description": "Family-friendly poultry-only dinners with South African and Mediterranean comfort flavors; mild heat, 30–45 minutes, simple steps, balanced budget, and explicit avoidance of fish and shellfish for straightforward halal-aligned weeknights."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_7k3f9w",
      "name": "Couple Vegetarian Cozy Evenings (Mediterranean & Modern American)",
      "action": "keep",
      "notes": "Distinct couple vegetarian at Intermediate complexity and 30–45 timing; keep for balance.",
      "suggested_changes": {},
      "replacement_proposal": null
    },
    {
      "uid": "arch_1k7p9f",
      "name": "Jain-Friendly Vegan Weeknight Basics (No-Heat, Affordable Family)",
      "action": "modify",
      "notes": "Overlaps with arch_5u6h1q, but retains HighProtein tag. Clarify HighProtein emphasis and keep Indo–SouthAfrican blend; remove core_tags.Allergens.",
      "suggested_changes": {
        "core_tags": {
          "Allergens": []
        },
        "description": "Family-friendly vegan dinners with Jain guardrails (no root vegetables), no-heat seasoning, quick 15–30 minute steps, Affordable spend, and a deliberate HighProtein emphasis via legume/grain pairings using Indian and South African staples."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_6e4b9k",
      "name": "Pescatarian Mediterranean Entertaining (Shellfish-Free)",
      "action": "modify",
      "notes": "Advanced entertaining is valuable. Shift heat to Hot to increase hot-band coverage; keep PremiumOccasion to preserve budget distribution.",
      "suggested_changes": {
        "core_tags": {
          "HeatSpice": [
            "Hot"
          ]
        },
        "description": "Advanced, hot, fish-focused Mediterranean menus for small gatherings; shellfish-free by design, PremiumOccasion budget, 30–45 minutes active with advanced techniques; aligned to South African kitchens."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_5k3f9z",
      "name": "Vegan High-Protein Meal Prep (SE Asia, Hands-Off)",
      "action": "modify",
      "notes": "Good plant-forward MealPrep. To diversify heat bands, set this to ExtraHot with explicit opt-in, and clarify nut/sesame optionality.",
      "suggested_changes": {
        "core_tags": {
          "HeatSpice": [
            "ExtraHot"
          ],
          "Allergens": []
        },
        "description": "Plant-based, protein-focused batch cooks with hands-off methods for budget-savvy meal preppers; Southeast Asian flavors, ExtraHot (opt-in), Affordable spend, clear avoidance of dairy/egg/fish/shellfish; soy included by default, nuts/sesame optional add-ons."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_k7x9s2",
      "name": "Family Flexitarian Regional Twists (SA & Mediterranean, 15-30, Mild, Balanced)",
      "action": "modify",
      "notes": "Solid mainstream flexitarian family. Convert complexity to Intermediate to help balance tier counts without changing time/heat.",
      "suggested_changes": {
        "core_tags": {
          "Complexity": [
            "Intermediate"
          ]
        },
        "description": "Balanced weeknight recipes for families who mix veg-forward meals with occasional lean meats; Mild for kids, 15–30 minutes, Intermediate steps (multi-component build), Balanced budget, South African staples with Mediterranean twists."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_j3q9x1",
      "name": "Couple Low-Carb Global Explorer (East Asian, 15–30, Medium, Affordable)",
      "action": "modify",
      "notes": "Meets LowCarb adventurous couple need. Adjust to Hot to increase hot-band coverage and clarify low-sugar sauces.",
      "suggested_changes": {
        "core_tags": {
          "HeatSpice": [
            "Hot"
          ],
          "EthicsReligious": []
        },
        "description": "For adventurous couples eating low-carb on a budget: East Asian-inspired, hot dishes ready in 15–30 minutes with Intermediate steps; uses low-sugar sauces and grain-free sides."
      },
      "replacement_proposal": null
    },
    {
      "uid": "arch_3k9x8h",
      "name": "Family Vegetarian Weeknight Classics (SA & Modern American, 15–30, Mild, Affordable)",
      "action": "replace",
      "notes": "Third overlap in vegetarian family classics. Use this slot to add an ExperimentalFusion, LuxuryExperience Showstopper for Entertaining to satisfy missing openness and budget tiers.",
      "suggested_changes": {},
      "replacement_proposal": {
        "name": "Experimental Fusion Entertaining (LuxuryExperience, Showstopper)",
        "concept_summary": "Diet: Omnivore; Cuisine: SouthAfrican, EastAsian, Mediterranean (fusion); CuisineOpenness: ExperimentalFusion; PrepTime: 45Plus; Complexity: Showstopper; HeatSpice: Medium; Audience: Entertaining; BudgetLevel: LuxuryExperience; Allergen posture: not allergen-safe; provide swap notes. Purpose: Fill ExperimentalFusion + LuxuryExperience + Showstopper gap."
      }
    },
    {
      "uid": "arch_3a1b9k",
      "name": "Solo 10-Minute Omnivore Quick Bites (Value Staples)",
      "action": "replace",
      "notes": "Overlaps with two other solo quick-bite baselines. Replace with a Keto archetype per required diet coverage.",
      "suggested_changes": {},
      "replacement_proposal": {
        "name": "Keto Couple Steak-Night (Modern American & SA, 30–45, Advanced)",
        "concept_summary": "Diet: Keto, Omnivore; Cuisine: ModernAmerican, SouthAfrican; CuisineOpenness: FamiliarClassics; PrepTime: 30to45; Complexity: Advanced; HeatSpice: Medium; Audience: Couple; BudgetLevel: PremiumOccasion; Allergen posture: dairy-optional; nut-free default. Purpose: Cover missing Keto with a non-weeknight baseline and shift complexity upward."
      }
    }
  ],
  "overlap_clusters": [
    {
      "uids": [
        "arch_7e3a9b",
        "arch_7k0x9u",
        "arch_3k9x8h"
      ],
      "reason": "All three are Vegetarian family weeknight classics: Mild heat, 15–30, Familiar SA/Modern American with Balanced/Affordable budgets."
    },
    {
      "uids": [
        "arch_3b4f9k",
        "arch_8f2k9x",
        "arch_3a1b9k"
      ],
      "reason": "Solo Under-15 familiar quick bites with ValueStaples budgets; two Omnivore and one Flexitarian."
    },
    {
      "uids": [
        "arch_2p9k1f",
        "arch_3e2c1a"
      ],
      "reason": "Family weeknight omnivore classics, Mild, 15–30, Affordable, Familiar SA/Modern American; one Halal-friendly."
    },
    {
      "uids": [
        "arch_2s9h3k",
        "arch_3q1h2k"
      ],
      "reason": "Family PoultryOnly, Mild, Familiar SA flavors with religious guardrails (Kosher-style vs Halal)."
    },
    {
      "uids": [
        "arch_k7x3q9",
        "arch_3f6a9d"
      ],
      "reason": "Gluten-aware omnivore basics for families/meal-prep; NoHeat sheet-pan 45Plus vs 15–30 weeknights."
    },
    {
      "uids": [
        "arch_5u6h1q",
        "arch_1k7p9f"
      ],
      "reason": "Jain-friendly vegan family weeknights, NoHeat, Affordable, Indian-led; one has HighProtein and Indo–SA blend."
    },
    {
      "uids": [
        "arch_6e4b9k",
        "arch_5k3z9h"
      ],
      "reason": "Pescatarian entertaining with shellfish-free stance; different cuisines and complexity (Advanced vs Showstopper)."
    }
  ],
  "missing_areas": [
    "Keto diet archetype (any audience) – required by brief.",
    "LatinAmerican cuisine coverage for non-entertaining contexts.",
    "NorthAfrican cuisine coverage.",
    "ExperimentalFusion openness band (none present).",
    "Hot and ExtraHot dedicated archetypes for adventurous users.",
    "LuxuryExperience budget tier (needs multiple appearances).",
    "Dedicated Dairy-free archetype (now addressed via modification, but ensure QA).",
    "Dedicated Nut-free archetype (now addressed via modification, but ensure QA).",
    "Complexity distribution: Intermediate/Advanced/Showstopper tiers require more entries (target ≥6 each)."
  ],
  "summary": {
    "keep": 5,
    "modify": 17,
    "replace": 3,
    "notes": "Dataset hits 25 entries (within 24–28) and covers most diet/audience/cuisine basics. Gaps: no Keto, no NorthAfrican, limited LatinAmerican, no ExperimentalFusion, weak Hot/ExtraHot and LuxuryExperience presence, and heavy bias toward Simple complexity. Recommended changes reduce overlap, standardize allergen tag usage (remove nonstandard core_tags.Allergens; rely on allergen_flags), add Dairy-free and Nut-free dedicated postures, introduce Hot/ExtraHot and LuxuryExperience, and rebalance complexities by upgrading several archetypes. Next steps: implement modifications and replacements, then re-audit complexity counts to achieve ≥6 per tier, and add one NorthAfrican-focused archetype in a future swap if further overlap remains."
  }
}